In [5]:
import numpy as np
import pandas as pd

In [6]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [7]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [8]:
type(s)

pandas.core.series.Series

In [9]:
dates = pd.date_range('20130101', periods=6)

In [10]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01  0.048449  0.511754 -0.753287  0.133975
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009
2013-01-05  1.379308  0.219364 -0.584150 -0.529940
2013-01-06  0.694377 -1.247619 -1.794048  0.416963

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [13]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [14]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

The columns of the resulting DataFrame have different dtypes.

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Here is how to view the top and bottom rows of the frame:

In [16]:
df.head()

                   A         B         C         D
2013-01-01  0.048449  0.511754 -0.753287  0.133975
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009
2013-01-05  1.379308  0.219364 -0.584150 -0.529940

In [17]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009
2013-01-05  1.379308  0.219364 -0.584150 -0.529940
2013-01-06  0.694377 -1.247619 -1.794048  0.416963

Display the index, columns:

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy() gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

For df, our DataFrame of all floating-point values, DataFrame.to_numpy() is fast and doesn’t require copying data.

In [20]:
df.to_numpy()

array([[ 0.04844883,  0.51175388, -0.75328697,  0.1339748 ],
       [ 1.39265073, -0.10984721,  1.0077454 , -0.1554279 ],
       [-1.00904709, -0.97290157, -0.6032276 ,  0.39261312],
       [-0.02995149,  0.08374738, -1.34544918, -0.29800925],
       [ 1.37930791,  0.2193645 , -0.58414961, -0.52994046],
       [ 0.69437691, -1.24761856, -1.7940481 ,  0.41696259]])

For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() is relatively expensive.

In [21]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

describe() shows a quick statistic summary of your data:

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.412631 -0.252584 -0.678736 -0.006638
std    0.929942  0.699913  0.954238  0.384576
min   -1.009047 -1.247619 -1.794048 -0.529940
25%   -0.010351 -0.757138 -1.197409 -0.262364
50%    0.371413 -0.013050 -0.678257 -0.010727
75%    1.208075  0.185460 -0.588919  0.327954
max    1.392651  0.511754  1.007745  0.416963

Transposing your data:

In [23]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.048449    1.392651   -1.009047   -0.029951    1.379308    0.694377
B    0.511754   -0.109847   -0.972902    0.083747    0.219364   -1.247619
C   -0.753287    1.007745   -0.603228   -1.345449   -0.584150   -1.794048
D    0.133975   -0.155428    0.392613   -0.298009   -0.529940    0.416963

Sorting by an axis:

In [24]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.133975 -0.753287  0.511754  0.048449
2013-01-02 -0.155428  1.007745 -0.109847  1.392651
2013-01-03  0.392613 -0.603228 -0.972902 -1.009047
2013-01-04 -0.298009 -1.345449  0.083747 -0.029951
2013-01-05 -0.529940 -0.584150  0.219364  1.379308
2013-01-06  0.416963 -1.794048 -1.247619  0.694377

Sorting by values:

In [25]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.694377 -1.247619 -1.794048  0.416963
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009
2013-01-05  1.379308  0.219364 -0.584150 -0.529940
2013-01-01  0.048449  0.511754 -0.753287  0.133975

### Selection

Selecting a single column, which yields a Series, equivalent to df.A:

In [26]:
df['A']

2013-01-01    0.048449
2013-01-02    1.392651
2013-01-03   -1.009047
2013-01-04   -0.029951
2013-01-05    1.379308
2013-01-06    0.694377
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [27]:
df[0:3]

                   A         B         C         D
2013-01-01  0.048449  0.511754 -0.753287  0.133975
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613

In [28]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009

In [29]:
df

                   A         B         C         D
2013-01-01  0.048449  0.511754 -0.753287  0.133975
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009
2013-01-05  1.379308  0.219364 -0.584150 -0.529940
2013-01-06  0.694377 -1.247619 -1.794048  0.416963

In [30]:
df.loc[dates[0]]

A    0.048449
B    0.511754
C   -0.753287
D    0.133975
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
type(df.loc[dates[0]])

pandas.core.series.Series

Selecting on a multi-axis by label:

In [32]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.048449  0.511754
2013-01-02  1.392651 -0.109847
2013-01-03 -1.009047 -0.972902
2013-01-04 -0.029951  0.083747
2013-01-05  1.379308  0.219364
2013-01-06  0.694377 -1.247619

Showing label slicing, both endpoints are included:

In [33]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.392651 -0.109847
2013-01-03 -1.009047 -0.972902
2013-01-04 -0.029951  0.083747

Reduction in the dimensions of the returned object:

In [35]:
type(df.loc['20130102':'20130104', ['A', 'B']])

pandas.core.frame.DataFrame

In [34]:
df.loc['20130102', ['A', 'B']]

A    1.392651
B   -0.109847
Name: 2013-01-02 00:00:00, dtype: float64

In [36]:
type(df.loc['20130102', ['A', 'B']])

pandas.core.series.Series

For getting a scalar value:

In [37]:
df.loc[dates[0], 'A']

0.048448834023761524

For getting fast access to a scalar (equivalent to the prior method):

In [38]:
df.at[dates[0], 'A']

0.048448834023761524

Select via the position of the passed integers: (by index no)

In [39]:
df.iloc[3]

A   -0.029951
B    0.083747
C   -1.345449
D   -0.298009
Name: 2013-01-04 00:00:00, dtype: float64

In [46]:
df.iloc[3,2]

-1.3454491806535118

In [42]:
df.loc[dates[3]]

A   -0.029951
B    0.083747
C   -1.345449
D   -0.298009
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python:

In [43]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.029951  0.083747
2013-01-05  1.379308  0.219364

By lists of integer position locations, similar to the numpy/python style:

In [47]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.392651  1.007745
2013-01-03 -1.009047 -0.603228
2013-01-05  1.379308 -0.584150

For slicing rows explicitly:

In [49]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613

In [50]:
df.iloc[1:3]

                   A         B         C         D
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613

For slicing columns explicitly:

In [51]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.511754 -0.753287
2013-01-02 -0.109847  1.007745
2013-01-03 -0.972902 -0.603228
2013-01-04  0.083747 -1.345449
2013-01-05  0.219364 -0.584150
2013-01-06 -1.247619 -1.794048

For getting a value explicitly:

In [53]:
df.iloc[1, 1]

-0.10984721171571571

For getting fast access to a scalar (equivalent to the prior method):

In [54]:
df.iat[1, 1]

-0.10984721171571571

### Boolean indexing

In [55]:
df

                   A         B         C         D
2013-01-01  0.048449  0.511754 -0.753287  0.133975
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009
2013-01-05  1.379308  0.219364 -0.584150 -0.529940
2013-01-06  0.694377 -1.247619 -1.794048  0.416963

Using a single column’s values to select data.

In [56]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.048449  0.511754 -0.753287  0.133975
2013-01-02  1.392651 -0.109847  1.007745 -0.155428
2013-01-05  1.379308  0.219364 -0.584150 -0.529940
2013-01-06  0.694377 -1.247619 -1.794048  0.416963

Selecting values from a DataFrame where a boolean condition is met.

In [57]:
df[df>0]

                   A         B         C         D
2013-01-01  0.048449  0.511754       NaN  0.133975
2013-01-02  1.392651       NaN  1.007745       NaN
2013-01-03       NaN       NaN       NaN  0.392613
2013-01-04       NaN  0.083747       NaN       NaN
2013-01-05  1.379308  0.219364       NaN       NaN
2013-01-06  0.694377       NaN       NaN  0.416963

Using the isin() method for filtering:

In [58]:
df2 = df.copy()

In [59]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [60]:
df2

                   A         B         C         D      E
2013-01-01  0.048449  0.511754 -0.753287  0.133975    one
2013-01-02  1.392651 -0.109847  1.007745 -0.155428    one
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613    two
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009  three
2013-01-05  1.379308  0.219364 -0.584150 -0.529940   four
2013-01-06  0.694377 -1.247619 -1.794048  0.416963  three

In [61]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613   two
2013-01-05  1.379308  0.219364 -0.584150 -0.529940  four

### Setting

Setting a new column automatically aligns the data by the indexes.

In [63]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [64]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [65]:
df['F'] = s1

In [66]:
df

                   A         B         C         D    F
2013-01-01  0.048449  0.511754 -0.753287  0.133975  NaN
2013-01-02  1.392651 -0.109847  1.007745 -0.155428  1.0
2013-01-03 -1.009047 -0.972902 -0.603228  0.392613  2.0
2013-01-04 -0.029951  0.083747 -1.345449 -0.298009  3.0
2013-01-05  1.379308  0.219364 -0.584150 -0.529940  4.0
2013-01-06  0.694377 -1.247619 -1.794048  0.416963  5.0

Setting values by label:

In [67]:
df.at[dates[0], 'A'] = 0

Setting values by position:

In [68]:
df.iat[0, 1] = 0

Setting by assigning with a NumPy array:

In [70]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [71]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.753287  5  NaN
2013-01-02  1.392651 -0.109847  1.007745  5  1.0
2013-01-03 -1.009047 -0.972902 -0.603228  5  2.0
2013-01-04 -0.029951  0.083747 -1.345449  5  3.0
2013-01-05  1.379308  0.219364 -0.584150  5  4.0
2013-01-06  0.694377 -1.247619 -1.794048  5  5.0

A where operation with setting.

In [72]:
df2 = df.copy()

In [73]:
df2[df2 > 0] = -df2

In [74]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.753287 -5  NaN
2013-01-02 -1.392651 -0.109847 -1.007745 -5 -1.0
2013-01-03 -1.009047 -0.972902 -0.603228 -5 -2.0
2013-01-04 -0.029951 -0.083747 -1.345449 -5 -3.0
2013-01-05 -1.379308 -0.219364 -0.584150 -5 -4.0
2013-01-06 -0.694377 -1.247619 -1.794048 -5 -5.0

### Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [75]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [76]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [77]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.753287  5  NaN  1.0
2013-01-02  1.392651 -0.109847  1.007745  5  1.0  1.0
2013-01-03 -1.009047 -0.972902 -0.603228  5  2.0  NaN
2013-01-04 -0.029951  0.083747 -1.345449  5  3.0  NaN

To drop any rows that have missing data.

In [78]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.392651 -0.109847  1.007745  5  1.0  1.0

Filling missing data.

In [79]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.753287  5  5.0  1.0
2013-01-02  1.392651 -0.109847  1.007745  5  1.0  1.0
2013-01-03 -1.009047 -0.972902 -0.603228  5  2.0  5.0
2013-01-04 -0.029951  0.083747 -1.345449  5  3.0  5.0

To get the boolean mask where values are nan.

In [80]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

### Operations

Operations in general exclude missing data.

Performing a descriptive statistic:

In [82]:
df.mean()

A    0.404556
B   -0.337876
C   -0.678736
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis:

In [83]:
df.mean(1)

2013-01-01    1.061678
2013-01-02    1.658110
2013-01-03    0.882965
2013-01-04    1.341669
2013-01-05    2.002905
2013-01-06    1.530542
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [85]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [89]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [88]:
df.sub(s, axis='index') # subtract

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.009047 -1.972902 -1.603228  4.0  1.0
2013-01-04 -3.029951 -2.916253 -4.345449  2.0  0.0
2013-01-05 -3.620692 -4.780636 -5.584150  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

In [90]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.753287  5  NaN
2013-01-02  1.392651 -0.109847  1.007745  5  1.0
2013-01-03 -1.009047 -0.972902 -0.603228  5  2.0
2013-01-04 -0.029951  0.083747 -1.345449  5  3.0
2013-01-05  1.379308  0.219364 -0.584150  5  4.0
2013-01-06  0.694377 -1.247619 -1.794048  5  5.0

Applying functions to the data:

In [91]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.753287   5   NaN
2013-01-02  1.392651 -0.109847  0.254458  10   1.0
2013-01-03  0.383604 -1.082749 -0.348769  15   3.0
2013-01-04  0.353652 -0.999001 -1.694218  20   6.0
2013-01-05  1.732960 -0.779637 -2.278368  25  10.0
2013-01-06  2.427337 -2.027255 -4.072416  30  15.0

In [92]:
df.apply(lambda x: x.max() - x.min())

A    2.401698
B    1.466983
C    2.801794
D    0.000000
F    4.000000
dtype: float64

### String Methods

In [94]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [95]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [96]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object